Revit 2027 API
ProgressChangedEventArgs.UpperRange Property
 Upper part of progress bar range - will be any non-zero number
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int UpperRange { get; }
Public ReadOnly Property UpperRange As Integer
	Get
public:
property int UpperRange {
	int get ();
}
member UpperRange : int with get
Property Value
Int32
See Also
Reference
ProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace